<a href="https://colab.research.google.com/github/nureeee/numpy-pandas/blob/main/210520_%EC%98%A4%EC%A0%84%EC%88%98%EC%97%85.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#5월 20일 오전수업
## 코랩기초사용법

In [3]:
ls

sample_data/

### pwd==> print working directory 현재 위치 확인

In [4]:
!pwd

/content

In [5]:
!whoami

root

In [6]:
%history

ls
ls
ls
!pwd
!whoami
%history

In [7]:
import platform

In [8]:
platform.platform()

'Linux-5.4.109+-x86_64-with-Ubuntu-18.04-bionic'

In [ ]:
!nl /etc/issue.net

In [ ]:
!nl /proc/cpuinfo

In [ ]:
!nl /proc/meminfo

In [ ]:
!df -h  ###disk free 
        ### /dev/sda1       114G   41G   74G  36% /etc/hosts  ==>하드디스크 저장용량

##구글 하드디스크와 연결(마운트)

In [26]:
from google.colab import drive

In [18]:
drive.mount('/content/drive')

Mounted at /content/drive

In [20]:
!df -h  ## content/drive에서 파일을 저장하면 구글 드라이브에 자동 저장된다.

Filesystem      Size  Used Avail Use% Mounted on
overlay         108G   39G   70G  36% /
tmpfs            64M     0   64M   0% /dev
tmpfs           6.4G     0  6.4G   0% /sys/fs/cgroup
shm             5.9G     0  5.9G   0% /dev/shm
tmpfs           6.4G   24K  6.4G   1% /var/colab
/dev/sda1       114G   41G   74G  36% /etc/hosts
tmpfs           6.4G     0  6.4G   0% /proc/acpi
tmpfs           6.4G     0  6.4G   0% /proc/scsi
tmpfs           6.4G     0  6.4G   0% /sys/firmware
drive            15G  7.1G  8.0G  47% /content/drive

In [ ]:
!cat ess.xlsx

In [21]:
import pandas as pd

In [22]:
pd1 = pd.read_excel('/content/ess.xlsx')

In [23]:
pd1

  name  kor  eng  mat
0  이순신   85   87   90
1  강감찬   75   80   95
2  한석봉   99   98   99
3  황진이   35   45   20
4  안중근   90   85   90
5  박문수   95   98   96
6  임꺽정   15   35   45
7  김정호   90   95   80
8  정몽주   90   90   95
9  양주종   50   45   60

**볼드**

__bold__

**목요일**

*기울기*

~~취소선~~

<u> 밑줄<U>

[구글](http://google.com)
[코딩스쿨](http://func.kr)
[유튜브](http://youtube.com)

![바다](https://www.google.com/imgres?imgurl=https%3A%2F%2Fpost-phinf.pstatic.net%2FMjAxOTA4MjNfMTQy%2FMDAxNTY2NTM5Njk3MDc1.d-pxKdg0Ni8cppT3_g-TfaoL7eBjWdaQD7YsocRRpzIg.ftK-ZuCMq8X1Q-oeENQa5v1QdXPiSdNm7Gr8UuWdOJAg.JPEG%2F1%25ED%2599%2594_%25EB%25B0%2594%25EB%258B%25A4.jpg%3Ftype%3Dw1200&imgrefurl=https%3A%2F%2Fpost.naver.com%2Fviewer%2FpostView.nhn%3FvolumeNo%3D23925656%26memberNo%3D41049965&tbnid=srHcktgp02lkYM&vet=12ahUKEwi27uXPjNfwAhVXB6YKHS4qCDEQMygEegUIARDcAQ..i&docid=5k6aPnsoRXVDLM&w=1200&h=800&q=%EB%B0%94%EB%8B%A4&ved=2ahUKEwi27uXPjNfwAhVXB6YKHS4qCDEQMygEegUIARDcAQ)

#### ctrl + m + d ==>해당 칸 삭제
#### ctrl + m + a ==>해당 칸 위로 새로 칸 만들기
#### ctrl + m + b ==>해당 칸 아래로 새로운 칸 만들기

In [29]:
%hist

ls
ls
ls
!pwd
!whoami
%history
import platform
platform.platform()
!nl /etc/issue.net
!nl /proc/cpuinfo
!nl /proc/meminfo
!df -h  ###disk free
        ### /dev/sda1       114G   41G   74G  36% /etc/hosts  ==>하드디스크 저장용량
!ㅔㅈㅇ
!pwd
from googlw.colab import drive
from google.colab import drive
drive.mount('/contant/drive')
drive.mount('/content/drive')
!df -h
!df -h  ## content/drive에서 파일을 저장하면 구글 드라이브에 자동 저장된다.
import pandas as pd
pd1 = pd.read_excel('/content/ess.xlsx')
pd1
!cat ess.xlsx
dd
from google.colab import drive
!history
!hist
%hist

In [31]:
!ls  ## 업로드파일 확인??

drive  ess.xlsx  sample_data  ss.txt

In [32]:
!cat -n ss.txt  ##파일 읽기, 이런 방식으로는 엑셀파일 읽기 x

     1	이순신 85 87 90
     2	강감찬 75 80 95
     3	한석봉 99 98 99
     4	황진이 35 45 20
     5	안중근 90 85 90
     6	박문수 95 98 96
     7	임꺽정 15 35 45
     8	김정호 90 95 80
     9	정몽주 90 90 95
    10	이누리 50 45 60

In [39]:
!cat ss.txt

이순신 85 87 90
강감찬 75 80 95
한석봉 99 98 99
황진이 35 45 20
안중근 90 85 90
박문수 95 98 96
임꺽정 15 35 45
김정호 90 95 80
정몽주 90 90 95
이누리 50 45 60

In [42]:
d1 = pd.read_csv('/content/ss.txt')

In [48]:
d2 = pd.read_csv('/content/sc.csv', encoding = 'cp949')  
##텍스트 파일을 csv로 저장할 때 인코딩은 ANSI로 저장한다.

In [53]:
d3 = pd.read_excel('/content/se.xlsx', names = ['이름', '국어', '영어', '수학']) 
## 컬럼을 덮어씌움

In [54]:
d3

    이름  국어  영어  수학
0  강감찬  75  80  95
1  한석봉  99  98  99
2  황진이  35  45  20
3  안중근  90  85  90
4  박문수  95  98  96
5  임꺽정  15  35  45
6  김정호  90  95  80
7  정몽주  90  90  95
8  이누리  50  45  60

In [58]:
d = d3.copy()

In [59]:
type(d)

pandas.core.frame.DataFrame

In [60]:
d.shape

(9, 4)

In [61]:
d

    이름  국어  영어  수학
0  강감찬  75  80  95
1  한석봉  99  98  99
2  황진이  35  45  20
3  안중근  90  85  90
4  박문수  95  98  96
5  임꺽정  15  35  45
6  김정호  90  95  80
7  정몽주  90  90  95
8  이누리  50  45  60

In [62]:
d.ndim

2

In [63]:
d.size

36

In [74]:
d5 = pd.read_excel('/content/se.xlsx', header=None,)
## header가 빈칸으로 만들어 줘야 컬럼을 넣을 때 '이순신'행을 덮어씌우지 않는다.

## header가 빈칸으로 만들어 줘야 컬럼을 넣을 때 '이순신'행을 덮어씌우지 않는다.

In [78]:
d5.columns = ['이름', '국어', '영어', '수학']

In [79]:
d5

    이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99
3  황진이  35  45  20
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  이누리  50  45  60

In [80]:
d = d5.copy()

In [82]:
d.head()

    이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99
3  황진이  35  45  20
4  안중근  90  85  90

In [83]:
d.tail()

    이름  국어  영어  수학
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  이누리  50  45  60

In [87]:
d.head(3)

    이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99

In [85]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      10 non-null     object
 1   국어      10 non-null     int64
 2   영어      10 non-null     int64
 3   수학      10 non-null     int64
dtypes: int64(3), object(1)
memory usage: 448.0+ bytes

In [88]:
d.describe()

              국어         영어         수학
count  10.000000  10.000000  10.000000
mean   72.400000  75.800000  77.000000
std    28.883675  24.371203  26.670833
min    15.000000  35.000000  20.000000
25%    56.250000  53.750000  65.000000
50%    87.500000  86.000000  90.000000
75%    90.000000  93.750000  95.000000
max    99.000000  98.000000  99.000000

In [89]:
d.describe

<bound method NDFrame.describe of     이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99
3  황진이  35  45  20
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  이누리  50  45  60>

In [90]:
d.index

RangeIndex(start=0, stop=10, step=1)

In [91]:
d.columns

Index(['이름', '국어', '영어', '수학'], dtype='object')

In [96]:
d[['이름', '국어']] ## 두개를 이상을 부를 때는 []로 다시한번 묶어준다

    이름  국어
0  이순신  85
1  강감찬  75
2  한석봉  99
3  황진이  35
4  안중근  90
5  박문수  95
6  임꺽정  15
7  김정호  90
8  정몽주  90
9  이누리  50

In [104]:
d.loc[0]

이름    이순신
국어     85
영어     87
수학     90
Name: 0, dtype: object

In [105]:
d.loc[3:6] ## n-1이 적용되지 않는다.

    이름  국어  영어  수학
3  황진이  35  45  20
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45

In [110]:
d[:]

    이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99
3  황진이  35  45  20
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  이누리  50  45  60

In [108]:
d[::2]

    이름  국어  영어  수학
0  이순신  85  87  90
2  한석봉  99  98  99
4  안중근  90  85  90
6  임꺽정  15  35  45
8  정몽주  90  90  95

In [113]:
d.loc[2:3,['영어', '수학']] ## 앞쪽이 인텍스 뒤쪽이 컬럼

   영어  수학
2  98  99
3  45  20

In [114]:
d['국어']

0    85
1    75
2    99
3    35
4    90
5    95
6    15
7    90
8    90
9    50
Name: 국어, dtype: int64

In [115]:
d[['이름', '영어']]

    이름  영어
0  이순신  87
1  강감찬  80
2  한석봉  98
3  황진이  45
4  안중근  85
5  박문수  98
6  임꺽정  35
7  김정호  95
8  정몽주  90
9  이누리  45

In [117]:
d.loc[3] ##이때 3은 인덱스를 의미한다(인덱싱)

이름    황진이
국어     35
영어     45
수학     20
Name: 3, dtype: object

In [118]:
d.loc[5:9] ##슬라이싱

    이름  국어  영어  수학
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  이누리  50  45  60

In [120]:
d.loc[::-1]

    이름  국어  영어  수학
9  이누리  50  45  60
8  정몽주  90  90  95
7  김정호  90  95  80
6  임꺽정  15  35  45
5  박문수  95  98  96
4  안중근  90  85  90
3  황진이  35  45  20
2  한석봉  99  98  99
1  강감찬  75  80  95
0  이순신  85  87  90

In [121]:
d.loc[2:8:3]

    이름  국어  영어  수학
2  한석봉  99  98  99
5  박문수  95  98  96
8  정몽주  90  90  95

In [122]:
d.loc[ : , : ]

    이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99
3  황진이  35  45  20
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  이누리  50  45  60

In [ ]:
d[3] ##에러

In [125]:
d.loc[ : ,['수학', '영어']]

   수학  영어
0  90  87
1  95  80
2  99  98
3  20  45
4  90  85
5  96  98
6  45  35
7  80  95
8  95  90
9  60  45

In [127]:
d.loc[5:6 ,['수학', '영어']]

   수학  영어
5  96  98
6  45  35

In [128]:
d.loc[ : :2 ,['수학', '영어']]

   수학  영어
0  90  87
2  99  98
4  90  85
6  45  35
8  95  90

In [ ]:
d[3][2] ##에러

In [130]:
d.loc[3][2]

45

In [131]:
d.loc[0][0]

'이순신'

In [132]:
d.ndim

2

In [133]:
d.shape

(10, 4)

In [135]:
type(d['국어']) ##전체는 데이터 프레임(2차원)이고 '국어'열 하나는 시리즈(1차원)

pandas.core.series.Series